app/controllers/articles_controller.rb

  def create
    @article = current_user.articles.build(article_params)
    if @article.save
---
INSERT INTO "articles" ("title", "body", "published_at", "user_id", "created_at", "updated_at") VALUES ('テスト記事3', '画像つき', NULL, 1, '2026-04-28 03:30:56.193222', '2026-04-28 03:30:56.193222') RETURNING "id"

  def update
    if @article.update(article_params)
---
UPDATE "articles" SET "published_at" = '2026-04-28 12:04:00', "updated_at" = '2026-04-28 03:04:14.738290' WHERE "articles"."id" = 2

  def set_article
    @article = Article.find(params[:id])
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = 1 LIMIT 1